\\192.168.0.111\_2021인공지능\c언어_윤성우pdf\c언어문제들  <= 이폴더 가시면 문제 있음

1. 두개의 정수를 입력 받아서 구구단을 출력하는 프로그램을 작성해보자
예를 들어서 프로그램 사용자가 3과 5를 입력하면 3,4,5단이 출력되어야하고
2와 4를 입력하면 2,3,4단이 출력되어야 한다.
단, 한가지 조건이 있다.
사용자는 두개의 숫자를 입력 할 때에 입력 순서에 자유로워야 한다.
3과 5를 입력하면 5와 3을 입력하건 프로그램 같은 결과를 출력해야한다.

2. 2의 n승을 구하는 함수를 재귀적으로 구현해보자. 그리고 그에 따른 
적절한 main 함수도 구현해보자. 참고로 재귀 함수의 구현이
처음에는 어려운 편이기 때문에 여기서는 쉬운 문제를 제시한다.

....예시 
정수 입력: 8
2의 8승은 256
....

3. int 형 변수 num1과 num2를 선언과 동시에 각각 10,20으로 
초기화 하고, int 형포인터 변수 ptr1과 ptr2를 선언하여 각각 num1,num2를 가르키게
하자. 그리고 이 상태에서 포인터 변수 ptr1과 ptr2를 이용해서 num1의 값을 10을
증가시키고, num2의 값을 10 감소시키자
이제 두 포인터 변수 ptr1과 ptr2가 가리키는 대상을 서로 바꾸자. 즉 포인터변수
ptr1이 num2 를 가르키게 하고, 포인터 변수 ptr2가 num1을 가르키게 하자
그리고 마지막으로 ptr1과 ptr2가 가리키는 변수에 저장된 값을 출력해보자.